content/index.org
#+AUTHOR: Victor Dorneanu
#+SETUPFILE: notes-style.setup
#+TITLE: slides.dornea.nu
#+EXPORT_FILE_NAME: ../public/index.html
#+OPTIONS: num:nil ^:t p:t

* 2022
** DONE [[./2022/hexagonal-architecture][Hexagonal Architecture]]
CLOSED: [2022-10-23 Sun 13:04]
How to apply ports & adapters architecture in Python.
** DONE [[./2022/presentation-as-code/][Presentation as Code]]
CLOSED: [2022-01-14 Fri]
Create modern presentations using ORG mode and ~reveal.js~. Also learn how to use [[https://c3js.org/][c3js]],
[[https://plantuml.com/][plantUML]], literate programming effectively and document everything as code.
* About
This page lists all slides/presentations I've published. I use Emacs, ORG mode and some
HTML/CSS to generate this page. For the presentations I use [[https://revealjs.com][reveal.js]]. You may want to
have a look at the [[https://github.com/dorneanu/slides][slides]] repository.
* Comment                                                                                           :noexport:
# Local variables:
# after-save-hook: org-html-export-to-html
# end:
